#+TITLE: Elisp
#+STARTUP: CONTENT

** How evaluation works
+ Lists
+ Symbols
+ all other object types
#+begin_src emacs-lisp
;; Primitives are usually self-evaluating
42

"Hello!"

[1 2 (+ 1 2)]

;; Not self-evaluating
buffer-file-name

;; Evaluates a function
(+ 41 1)

;; if we evaluate a list, lisp expects the first argument to be a function
(300 100)

;; nested expressions
(+ 300 (- 200 100)
   (* 5 5))
#+end_src

#+RESULTS:
: Hello!
** If statement
=if= evaluates an expression and based on the result, picks one of two branchecs
to evaluate next.

The true branch is a single expression, the false branch can be multiple
expressions.
#+begin_src emacs-lisp :tangle yes
(if t 5
  ;; you can add an arbitrary number of forms in the false branch
  (message "Doing the extra stuff here")
  (+ 2 2))
#+end_src

#+RESULTS:
: 5

We can use the =progn= expression to execute multiple commands in the =true=
branch
#+begin_src emacs-lisp :tangle yes
(if nil
    ;; true branch
    (progn
      (message "Hey, it is true!")
      5)
  ;; false branch
  (message "Doing some extra stuff here!")
  (+ 2 (* 3 5)))
#+end_src
